src/Catalogs/УР_Смены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УР_Смены</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеоплачиваемоеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УР_ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/УР_Смены/Forms/ФормаЭлемента/module.bsl
// Обработчик события ПриИзменении поля ввода ВремяНачала.
//
Процедура ВремяНачалаПриИзменении(Элемент)
	
	РассчитатьДлительность();
	
КонецПроцедуры

// Процедура рассчитывает длительность смены.
//
Процедура РассчитатьДлительность()

	мВремяНачала = Дата(1,1,1,Час(ВремяНачала), Минута(ВремяНачала),0);
	мВремяОкончания = Дата(1,1,1,Час(ВремяОкончания), Минута(ВремяОкончания),0);
	
	Если мВремяОкончания < мВремяНачала Тогда
		мВремяОкончания = мВремяОкончания + 60*60*24;
	КонецЕсли;
	
	ВсегоМинут = Цел((мВремяОкончания - мВремяНачала) / 60);
	ДлительностьЧасов = Цел(ВсегоМинут / 60);
	ДлительностьМинут = ВсегоМинут - ДлительностьЧасов * 60;
	Длительность = Дата(1,1,1,ДлительностьЧасов, ДлительностьМинут,0);
	
КонецПроцедуры

// Обработчик события ПриИзменении поля ввода ДлительностьЧас.
//
Процедура ДлительностьЧасПриИзменении(Элемент)
	
	мВремяОкончания = ВремяНачала + Час(Длительность)*60*60 + Минута(Длительность)*60;
	ВремяОкончания = Дата(1,1,1,Час(мВремяОкончания), Минута(мВремяОкончания),0);
	
КонецПроцедуры
